Revit 2027 API
IFCParameterTemplate.ExportIFCCommonPropertySets Property
 The option to export IFC common property sets for exported Revit elements. If true, then all IFC Common Property Sets not excluded will be exported. If false, then no IFC Common Property Sets will be exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ExportIFCCommonPropertySets { get; set; }
Public Property ExportIFCCommonPropertySets As Boolean
	Get
	Set
public:
property bool ExportIFCCommonPropertySets {
	bool get ();
	void set (bool value);
}
member ExportIFCCommonPropertySets : bool with get, set
Property Value
Boolean
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace